# encoding: utf-8
require 'simplecov'
SimpleCov.start
require File.expand_path(File.join('.', 'spec_helper'), File.dirname(__FILE__))
require 'conversor'    


describe "E-NDFA To DFA conversor" do
  
  before(:each) do
    alphabect = ['', '+', '-', '.', '0', '1', '2', '3','4','5','6','7','8','9']
    endfa_hash       = { 	
                          :ø =>  {
                                    ''        =>  ['ø'],
                                    '+'       =>  ['ø'],
                                    '-'       =>  ['ø'],
                                    '.'       =>  ['ø'],
                                    '0'       =>  ['ø'],  
                                    '1'       =>  ['ø'],  
                                    '2'       =>  ['ø'],  
                                    '3'       =>  ['ø'],  
                                    '4'       =>  ['ø'],  
                                    '5'       =>  ['ø'],  
                                    '6'       =>  ['ø'],  
                                    '7'       =>  ['ø'],  
                                    '8'       =>  ['ø'],  
                                    '9'       =>  ['ø'] 
                                  },
                          :q0 =>  {
                                    ''        =>  ['q1'],
                                    '+'       =>  ['q1'],
                                    '-'       =>  ['q1'],
                                    '.'       =>  ['ø'],
                                    '0'       =>  ['ø'],  
                                    '1'       =>  ['ø'],  
                                    '2'       =>  ['ø'],  
                                    '3'       =>  ['ø'],  
                                    '4'       =>  ['ø'],  
                                    '5'       =>  ['ø'],  
                                    '6'       =>  ['ø'],  
                                    '7'       =>  ['ø'],  
                                    '8'       =>  ['ø'],  
                                    '9'       =>  ['ø'] 
                                  },
                          :q1 =>  {
                                    ''        =>  ['ø'],
                                    '+'       =>  ['ø'],
                                    '-'       =>  ['ø'],
                                    '.'       =>  ['q2'],
                                    '0'       =>  ['q1', 'q4'],  
                                    '1'       =>  ['q1', 'q4'],  
                                    '2'       =>  ['q1', 'q4'],  
                                    '3'       =>  ['q1', 'q4'],  
                                    '4'       =>  ['q1', 'q4'],  
                                    '5'       =>  ['q1', 'q4'],  
                                    '6'       =>  ['q1', 'q4'],  
                                    '7'       =>  ['q1', 'q4'],  
                                    '8'       =>  ['q1', 'q4'],  
                                    '9'       =>  ['q1', 'q4'] 
                                  }, 
                          :q2 =>  {
                                     ''        =>  ['ø'],
                                     '+'       =>  ['ø'],
                                     '-'       =>  ['ø'],
                                     '.'       =>  ['ø'],
                                     '0'       =>  ['q3'],  
                                     '1'       =>  ['q3'],  
                                     '2'       =>  ['q3'],  
                                     '3'       =>  ['q3'],  
                                     '4'       =>  ['q3'],  
                                     '5'       =>  ['q3'],  
                                     '6'       =>  ['q3'],  
                                     '7'       =>  ['q3'],  
                                     '8'       =>  ['q3'],  
                                     '9'       =>  ['q3']
                                  },
                          :q3 =>  {
                                     ''        =>  ['q5'],
                                     '+'       =>  ['ø'],
                                     '-'       =>  ['ø'],
                                     '.'       =>  ['ø'],
                                     '0'       =>  ['q3'],  
                                     '1'       =>  ['q3'],  
                                     '2'       =>  ['q3'],  
                                     '3'       =>  ['q3'],  
                                     '4'       =>  ['q3'],  
                                     '5'       =>  ['q3'],  
                                     '6'       =>  ['q3'],  
                                     '7'       =>  ['q3'],  
                                     '8'       =>  ['q3'],  
                                     '9'       =>  ['q3']
                                  },                                                                                                    
                          :q4 =>  {
                                     ''        =>  ['ø'],
                                     '+'       =>  ['ø'],
                                     '-'       =>  ['ø'],
                                     '.'       =>  ['q3'],
                                     '0'       =>  ['ø'],  
                                     '1'       =>  ['ø'],  
                                     '2'       =>  ['ø'],  
                                     '3'       =>  ['ø'],  
                                     '4'       =>  ['ø'],  
                                     '5'       =>  ['ø'],  
                                     '6'       =>  ['ø'],  
                                     '7'       =>  ['ø'],  
                                     '8'       =>  ['ø'],  
                                     '9'       =>  ['ø']
                                  },
                          :q5 =>  {
                                     ''        =>  ['ø'],
                                     '+'       =>  ['ø'],
                                     '-'       =>  ['ø'],
                                     '.'       =>  ['ø'],
                                     '0'       =>  ['ø'],  
                                     '1'       =>  ['ø'],  
                                     '2'       =>  ['ø'],  
                                     '3'       =>  ['ø'],  
                                     '4'       =>  ['ø'],  
                                     '5'       =>  ['ø'],  
                                     '6'       =>  ['ø'],  
                                     '7'       =>  ['ø'],  
                                     '8'       =>  ['ø'],  
                                     '9'       =>  ['ø']
                                  }                                                                      
                  		}   
    @endfa = Conversor.new(endfa_hash, alphabect, [:q5], :q0)                 		 
                  		                                                                                                   
  end
  
  describe "When converting" do
    
    it "should get simple e-close for state" do
      @endfa.eclose('q1').should == ["q1"]
      @endfa.eclose(:q1).should == ["q1"]      
    end                             
    
    it "should get composite e-close for state" do
       @endfa.eclose(:q3).should == ['q3', 'q5']
    end  
    
    it "should get e-close for epsilon state" do
       @endfa.eclose(:ø).should == ['ø']
    end
    
    it "should convert" do
      @endfa.to_dfa
       
    end
    
  end
  
end